{"name":"The Beginning of the End","description":"Is this the beginning of the end? Or is it the end of the beginning? Who\u0027s to say that this is a beginning or an end at all? I awoke here, knowing everything, but remembering nothing. My knowledge of... the world, assuming that this place is part of it, could fill tomes, and yet, when I attempt to recall who I am, I remember nothing. Nothing of my identity, my past, whether I loved or was loved. Nothing here remains, except the facts of life.","quests":[{"uuid":"5b40984e-29b9-4124-9521-9243b202245e","name":"Tree of Life","description":"The first task, it would appear, is to find some building materials, as well as a bit of food. Apples would be nice, even though I\u0027m not sure I should trust them, what with these trees being oaks. Whatever. They\u0027re food.","x":53,"y":18,"icon":{"id":"minecraft:log"},"prerequisites":["3a24ec33-b7e6-4765-9914-4421e141222c"],"tasks":[{"type":"DETECT","longDescription":"Apples are probably the more important part of this quest. You\u0027ll be struggling for food since you don\u0027t have irrigation yet.","items":[{"item":{"id":"minecraft:log"},"required":64},{"item":{"id":"minecraft:apple"},"required":16}]}],"commandrewards":[]},{"uuid":"3a61992b-6a11-4676-8ecf-a0c43f4148b0","name":"Fancy Rocks","description":"As long as I\u0027m experimenting with this strange crystal, I might as well see if any other materials might interact with the energy. Bones were the first material that noticeably reacted to the crystal. Maybe I can find a way to imbue stone with this property of bone...","x":190,"y":71,"icon":{"id":"astralsorcery:blockmarble"},"prerequisites":["6d223b63-2034-4a71-b60b-a07f0b1fd3ef"],"tasks":[{"type":"DETECT","longDescription":"I promise this is how marble is made in the real world. Pinkie swear, cross my heart, etc. On a slightly more relevant note, this is the last time I\u0027ll tell you to build a mob farm. It really is quite useful, you know.","items":[{"item":{"id":"astralsorcery:blockmarble"},"required":6},{"item":{"id":"astralsorcery:blockblackmarble"}}]}],"commandrewards":[]},{"uuid":"76557862-2ef9-4e82-ae88-d6414b549926","name":"Wrath of Gods","description":"That was... not the reaction I expected. Such a swift and hostile reaction from Hualti and Zazeca brings forth more questions than answers. In the mythos, they were always so helpful... I wonder what could have caused their change of heart?","x":135,"y":68,"icon":{"id":"minecraft:skull","damage":3},"prerequisites":["6687f3b5-2559-4f11-b86d-900d46ccde67"],"tasks":[{"type":"KILL","longDescription":"Hualti\u0027s bolts will set you on fire as though she were a blaze, Zazeca\u0027s will deal less damage, but slow you down considerably.","mobs":[{"name":"New","mob":"ZombieHorse","kills":1,"exact":false}]}],"commandrewards":[]},{"uuid":"ce3e12cb-09da-402a-b761-e4d3cff1f00e","name":"Malignant Spirits","description":"It appears that Nazeca holds firmer sway over this land than I had expected. Monsters swiftly spawn on swaths of dimly lit ground. Perhaps they could be of use...","x":68,"y":42,"icon":{"id":"minecraft:skull"},"prerequisites":["5b40984e-29b9-4124-9521-9243b202245e"],"tasks":[{"type":"DETECT","longDescription":"Do be aware that mobs will not spawn within 24 blocks of you or world spawn. This means that you must build a platform away from the original island in order to actually spawn mobs.","items":[{"item":{"id":"minecraft:bone"},"required":16},{"item":{"id":"minecraft:rotten_flesh"},"required":16},{"item":{"id":"minecraft:string"},"required":16}]}],"commandrewards":[]},{"uuid":"b6f28ae4-7048-4a89-9c1a-f556e029bcd7","name":"What Sorcery?!","description":"The crystal in front of the statue pulsates with some sort of strange energy. Perhaps this energy might resonate with certain materials? Bones seemed to float and twitch as I get closer to it... Maybe I could use that to make some sort of tinkering device...","x":146,"y":91,"icon":{"id":"astralsorcery:itemwand"},"prerequisites":["76557862-2ef9-4e82-ae88-d6414b549926"],"tasks":[{"type":"DETECT","longDescription":"Placing a crafting table underneath the crystal will allow the energy from the crystal to be directed into your creations. If you STILL haven\u0027t set up your mob farm, you\u0027ll be having a rough time starting your carreer as a magician. Bones and ender pearls are kind of important for making magic.","items":[{"item":{"id":"astralsorcery:itemwand"}}]}],"commandrewards":[]},{"uuid":"f597be64-72c1-4a2b-936d-4d1f253f67f1","name":"Augmentation","description":"It seems to be light that the mysterious crystal reacts with. Extremely bright materials, such as bone, seem to react positively to the crystal, while darker materials, such as charcoal, seem to control the reaction. I have an idea as to how I can further enhance these energies when crafting new items...","x":175,"y":94,"icon":{"id":"astralsorcery:blockaltar"},"prerequisites":["3a61992b-6a11-4676-8ecf-a0c43f4148b0","b6f28ae4-7048-4a89-9c1a-f556e029bcd7"],"tasks":[{"type":"DETECT","longDescription":"This new crafting table doesn\u0027t need to be directly under the crystal, but does need direct sky access, and the light of the sun seems too powerful, halting all usability during daytime. A small aside, if you\u0027re looking towards the future, leave a good amount of space around this guy. It\u0027ll need it.","items":[{"item":{"id":"astralsorcery:blockaltar"}}]}],"commandrewards":[]},{"uuid":"3a24ec33-b7e6-4765-9914-4421e141222c","name":"A New Beginning","description":"Where... .  .   .                                                                        This place feels familiar, and yet, I am sure I have never been here before. Strange. Then again, I awoke here knowing everything but remembering nothing. At the very least, survival seems a noble goal.","x":25,"y":18,"icon":{"id":"minecraft:sapling"},"reward":[{"id":"minecraft:sapling","amount":4}],"commandrewards":[]},{"uuid":"291a7c70-507f-40ef-8924-564c4c4b1e91","name":"Bread of Life","description":"While an apple a day does seem to keep the doctor away, I attribute that mainly to the lack of doctors on this island, and not to the apples I keep eating. There must be something more filling that I can cook up on this island.","x":53,"y":68,"icon":{"id":"minecraft:wheat"},"prerequisites":["212a1628-7dba-4afe-8feb-3c53ec2174c3","e2474464-a718-4146-b45a-5c6fd68c668b"],"tasks":[{"type":"DETECT","longDescription":"You should be able to find seeds in tall grass, or just in grass blocks with the help of a hoe.","items":[{"item":{"id":"minecraft:wheat"},"required":24}]},{"type":"DETECT","longDescription":"Don\u0027t worry about the fact that you don\u0027t cook the bread. It\u0027s a flatbread. Don\u0027t think too hard.","items":[{"item":{"id":"minecraft:bread"},"required":8}]}],"commandrewards":[]},{"uuid":"ad0a3a80-afab-47a6-9dbc-6c24bad60c77","name":"A Splash of Color","description":"While chlorophyll does provide a lovely color, the sheer repetition makes the whole island look a bit drab. I\u0027ve noticed some small flecks of color in the grass, perhaps some of the marrow can bring the color out?","x":97,"y":43,"icon":{"id":"minecraft:red_flower"},"prerequisites":["212a1628-7dba-4afe-8feb-3c53ec2174c3","e57a3c15-88a3-4579-b66a-9c2d4d63b942"],"tasks":[{"type":"DETECT","longDescription":"Bonemeal is quite useful. In addition to accellerating crop and sapling growth, it can even encourage growth of new plants straight from grass blocks.","items":[{"item":{"id":"minecraft:red_flower"},"required":5,"precision":"FUZZY"}]}],"commandrewards":[]},{"uuid":"212a1628-7dba-4afe-8feb-3c53ec2174c3","name":"Fertilization","description":"Bone marrow is surprisingly fruitful, capable of fertilizing every plant I have tried so far. It even manages to bring out beautiful flowers from this drab island.","x":83,"y":67,"icon":{"id":"minecraft:dye","damage":15},"prerequisites":["ce3e12cb-09da-402a-b761-e4d3cff1f00e"],"tasks":[{"type":"DETECT","longDescription":"If you haven\u0027t yet built a mob farm yet, now is probably the time to do so. You don\u0027t have water to push mobs yet, so full automation might not be in the works. Manually slaying mobs isn\u0027t that difficult, however, especially if you have turned mob griefing off.","items":[{"item":{"id":"minecraft:dye","damage":15},"required":32}]}],"commandrewards":[]},{"uuid":"62339064-aab2-4342-9b0b-131a2d60da07","name":"Homely Spaces","description":"Though I am presumably in exile, some small amount of comfort would be nice. A bed to rest my tired back and some carpet on which to rest my sore feet would do wonders for my spirit.","x":111,"y":18,"icon":{"id":"minecraft:spawn_egg","nbt":"{EntityTag:{id:\"minecraft:horse\"}}"},"prerequisites":["e57a3c15-88a3-4579-b66a-9c2d4d63b942"],"tasks":[{"type":"DETECT","longDescription":"While not strictly necessary, would you like to stay up 24/7 and walk barefoot on grass and unpolished wood? No? I thought not.","items":[{"item":{"id":"minecraft:bed","damage":14},"precision":"FUZZY"},{"item":{"id":"minecraft:carpet"},"required":2,"precision":"FUZZY"},{"item":{"id":"minecraft:crafting_table"}}]}],"commandrewards":[]},{"uuid":"e57a3c15-88a3-4579-b66a-9c2d4d63b942","name":"Terra Nova","description":"This strange floating island, while large enough to grow a few trees, is not quite large enough for anything more than that. I should fix that.","x":82,"y":18,"icon":{"id":"minecraft:grass"},"prerequisites":["5b40984e-29b9-4124-9521-9243b202245e"],"tasks":[{"type":"DETECT","longDescription":"This is really a sort of exponential growth. More trees means more dirt, which can be used to grow more trees. It\u0027s and upward spiral that I suggest you get started on.","items":[{"item":{"id":"minecraft:dirt"},"required":8}]}],"commandrewards":[]},{"uuid":"6687f3b5-2559-4f11-b86d-900d46ccde67","name":"A Plea for Help","description":"The Sister Gods - Hualti and Zazeca - were always known to help those in need. I should ask them for their help and guidance as I try to escape from this wretched island.","x":112,"y":67,"icon":{"id":"minecraft:bedrock"},"prerequisites":["ad0a3a80-afab-47a6-9dbc-6c24bad60c77"],"trigger":"ANTI_TRIGGER","tasks":[{"type":"CRAFT","items":[{"item":{"id":"minecraft:bedrock"}}]}],"commandrewards":[]},{"uuid":"58af23ae-0f19-47f9-8e6f-ca75264c960a","name":"Sooty Black Stuff","description":"Lava is hot, wood burns when hot. I recall that burning wood without access to air provides a substance that burns at a much higher temperature than the wood itself. Such a material could be useful.","x":163,"y":70,"icon":{"id":"minecraft:bedrock"},"prerequisites":["76557862-2ef9-4e82-ae88-d6414b549926"],"tasks":[{"type":"DETECT","items":[{"item":{"id":"minecraft:bedrock"},"required":4}]},{"type":"DETECT","items":[{"item":{"id":"minecraft:coal","damage":1},"required":36}]}],"commandrewards":[]},{"uuid":"bc44b3a5-0f26-49b9-bcc2-c3fb5790fca8","name":"Piles of Rock","description":"The twin gods left behind an interesting haul. Lava and water seem to interact in strange ways, allowing for a seemingly infinite source of rocks. This inorganic material may be useful as a building material; at the very least, the gray would break up the greens and browns so prevalent in this lonely island.","x":148,"y":48,"icon":{"id":"minecraft:cobblestone"},"prerequisites":["76557862-2ef9-4e82-ae88-d6414b549926"],"tasks":[{"type":"DETECT","longDescription":"If lava and water are allowed to run into each other, the flowing lava will turn into cobblestone. Do be careful not to allow source blocks to interact with the opposing fluids, as a single obsidian block is slightly less useful than infinite cobblestone.","items":[{"item":{"id":"minecraft:cobblestone"},"required":64}]}],"commandrewards":[]},{"uuid":"6d223b63-2034-4a71-b60b-a07f0b1fd3ef","name":"Fireplaces","description":"It does get quite cold, out in the open above the void. Also, avoiding salmonella is a top priority. Tasty as raw meat is, salmonella is not very fun. At all.","x":177,"y":48,"icon":{"id":"minecraft:furnace"},"prerequisites":["58af23ae-0f19-47f9-8e6f-ca75264c960a","bc44b3a5-0f26-49b9-bcc2-c3fb5790fca8"],"tasks":[{"type":"DETECT","longDescription":"Do note that wood cannot be burned in a furnace: Wood simply does not burn hot enough without bellows. As such, your only fuel source, for now, is charcoal.","items":[{"item":{"id":"minecraft:furnace"}}]}],"commandrewards":[]},{"uuid":"e2474464-a718-4146-b45a-5c6fd68c668b","name":"Clever Machinations","description":"Punching oak makes for sore fists. If only there were a way to fell a tree without bloodying my knuckles...","x":39,"y":42,"icon":{"id":"minecraft:wooden_axe"},"prerequisites":["5b40984e-29b9-4124-9521-9243b202245e"],"tasks":[{"type":"DETECT","longDescription":"While wooden tools aren\u0027t the best, its all you\u0027ve got right now. You technically only need the pickaxe, but until you get stone, the other three will make your life much easier.","items":[{"item":{"id":"minecraft:wooden_axe"}},{"item":{"id":"minecraft:wooden_sword"}},{"item":{"id":"minecraft:wooden_shovel"}},{"item":{"id":"minecraft:wooden_hoe"}}]}],"commandrewards":[]}],"reputationBar":[]}